#+TITLE: Ideas

* golden ratio computation - with literate Org-mode / Python
Golden ratio: 1.618

1. B/A = f
2. A = 1
3. B = f
4. A + B = 1 + f
5. A (prosent): 1 / (1 + f) * 100
6. B (prosent): f / (1 + f) * 100

#+begin_src python :exports both
f = 1.618

return {"a": 1 / (1 + f) * 100,
        "b": f / (1 + f) * 100}
#+end_src

#+RESULTS:
| a | : | 38.19709702062642 | b | : | 61.80290297937356 |

38, 62

#+begin_src emacs-lisp :exports both
(let ((f 1.618))
  (list (* (/ 1 (+ 1 f)) 100)
        (* (/ f (+ 1 f)) 100)))
#+end_src

#+RESULTS:
| 38.19709702062642 | 61.80290297937356 |
* Programming is
Programming is:

1. A set of small mechanisms that do things
2. A language to speak about those mechanisms
3. And an incremental approach to building mechanisms and language.
* embedding org-mode
Idea: provide interface to Pandoc as a Sci function.
* using portal
Idea: tap> errors to portal, explore from there.
* idea: automatically link to source on Github - as a component
* idea: automatically link to page for published article
* idea: personal knowledge model straight in XTDB
** Contains a context sensitive bookmark database - where I can structure links in a system
** Contains all my podcasts
** Contains ... more?
** Q: What's the difference between that database and Roam?
*** A: The database has more structure, Roam has less structure.
*** A: Roam is nice for person-editable content, db is nice for machine-editable content
*** Idea: I can do bidirectional linking
Roam -> XTDB: teod.db/crux-id

XTDB -> Roam: teod.roam/roam-id

Steps: host XTDB instance (server) on db.teod.eu via Iterapp. But ... how to
make the connection nice?
*** Can I have the whole thing public?
db.teod.eu - be internet-wide readable?

Tentatively - that makes a /lot/ of sense.
* idea: preloaded sci env for pages
** Use case: provide stuff like "view page on web" as a component
** Use case: provide current file path as a component
or dynamic var?
** Should the sci env set its default directory?
* Understand borkdude's setup
His blog: https://github.com/borkdude/blog

Via Slack: https://clojurians.slack.com/archives/CLX41ASCS/p1640626516044200

New work - via Slack: https://github.com/borkdude/blog/commit/131663d19963dc601195e10ca0c62f5de03bee3e
